app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "comment") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["comment", "hi"]]
---
  def create
    @comment = @post.comments.new comment_params
    if @comment.save

UPDATE "comments" SET "comment" = $1, "user_id" = $2 WHERE "comments"."id" = $3  [["comment", "BYE!!! hi"], ["user_id", 2], ["id", 2]]
---
  def update
    if @comment.update comment_params

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    if current_user.id == @comment.user_id
      @comment.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_post
       @post = Post.find(params[:post_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_comment
      @comment = Comment.find(params[:id])