app/controllers/posts_controller.rb

  def create
    @post = Post.new post_params

    if @post.save!
---
INSERT INTO "posts" ("name", "title", "descripition", "job_type", "level", "location", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "1"], ["title", "1"], ["descripition", "1"], ["job_type", "1"], ["level", "1"], ["location", "1"], ["user_id", 2]]

  def update
    if @post.update post_params
---
UPDATE "posts" SET "job_type" = $1 WHERE "posts"."id" = $2  [["job_type", "Dev Ops"], ["id", 1]]

  def destroy
    if current_user.id == @post.user_id
      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]